{
  "_id": "vgbdBsthaggreen0",
  "_key": "!actors!vgbdBsthaggreen0",
  "name": "Hag, Green",
  "type": "npc",
  "img": "icons/svg/mystery-man.svg",
  "system": {
    "hd": 9,
    "hp": {
      "value": 40,
      "max": 40
    },
    "tl": 4.0,
    "armor": 3,
    "morale": 4,
    "zone": "frontline",
    "size": "medium",
    "beingType": "fae",
    "speed": {
      "value": 30
    },
    "appearing": "1",
    "senses": {
      "darkvision": true
    },
    "movement": {},
    "immunities": [],
    "weaknesses": [],
    "resistances": [],
    "actions": [
      {
        "name": "Actions",
        "description": "Multi-Attack: 2×Claw Claw [Melee Attack]: 4 (d8) and Restrained if it's this Being's second Claw to hit it this Turn Shapeshift [Cast, Self (Focus)]: Takes on the appearance of a Medium Humanlike.",
        "attackType": "special",
        "damage": "",
        "damageType": "",
        "range": "",
        "properties": []
      }
    ],
    "abilities": [
      {
        "name": "Abilities",
        "description": "Amphibious: It can breathe air and water.\nFade Out: When it Moves, it turns itself and anything it is carrying Invisible for the duration (Focus). If it has a Being Restrained, it turns them Invisible for the duration as well.\nMagic Ward II: Cast Checks that include it as a Target have a d6 penalty.\nTerror I: Enemies that can see it for the first time and at the start of their Turns must pass [Will] or be Frightened (Cd4).\nBestiary Bestiary 154 154 Hag, Grove TL: 9.7 Medium Fae (Shapechanger) Nightmarish brutes of crones that reside in swamps and dead woods. They are known for devouring humans with their iron claws and teeth.\nHD: 8 (36 HP)\b Speed: 50' (Cling) Zone: Frontline Morale: 10\b # Appearing: 1 Senses: Allsight, Darksight Armor: 4 [as (+1) Plate] Weak: Cold Iron Weapons ACTIONS Multi-Attack: 2×Claw and 1×Bite. A Being hit by all three is Restrained and takes 18 (4d8) damage at the start of this Being's Turns.\nBite [Melee Attack]: 7 (d8+3) Claw [Melee Attack]: 7 (d8+3) Shapeshift [Cast, Self] (Focus): Takes on the appearance of a Medium Humanlike.\nABILITIES Blair Omniscience: It is always aware of any Beings within the woodland it claims as its domain.\nMagic Ward I: Cast Checks that include it as a Target have a d4 penalty.\nTerror I: Enemies that can see it for the first time and at the start of their Turns must pass a [Will] Save or be Frightened until they pass this Check on a subsequent Turn, or for Cd4 Rounds afterwards."
      }
    ],
    "loot": "",
    "gmNotes": ""
  },
  "reviewed": false
}
